//Задача 108. Неглухой телефон
// В задаче нужно ввести(считать) число, а затем
//это число вывести.
//Для решения задачи достаточно использовать тип 
//int (int32_t)
#include <iostream>
int main()
{
    int32_t a;
    std::cin >> a;
    std::cout << a;
}
